#+title: ReadMe
* What is this?
This is a wrapper around [[https://github.com/nix-community/emacs-overlay][emacs-overlay]] which fixes an issue where the system nixpkgs version is used, rather than the one specified in the flake input. You should be able to point your input to this flake, and set what the emacs-overlay and nixpkgs are.
* How to use
Use this as a flake input:
#+begin_src nix
inputs.emacs-overlay = {
  url = "github:jeslie0/emacs-overlay"; # This repository.
  inputs.nixpkgs.url = "github:nixos/nixpkgs/NIXPKGSREVISION";
  inputs.emacs-overlay.url = "github:nix-community/EMACSOVERLAYREVISION";
};
#+end_src

The main point of this flake is to make it easier to pull from nix-community's cachix. To do that, find the build you want to pull on [[https://hydra.nix-community.org/project/emacs-overlay][hydra]], go to the Inputs tab ([[https://hydra.nix-community.org/build/18105324#tabs-buildinputs][as an example]]) and copy the nixpkgs and emacs-overlay (src) into their respective spot in the input.

This will let you use all of the packages that emacs-overlay provides, as a flake input. To use the overlay, I suggest doing something similar to the following:

#+begin_src nix
outputs = { self, nixpkgs, home-manager,  ... }:
  let
    system = "x86_64-linux"; #current system
    pkgs = import nixpkgs {
      inherit system;
      config = { allowUnfree = true; };
      overlays = [ self.inputs.emacs-overlay ]; # Add the overlay here!
    };

    lib = nixpkgs.lib;

  in {
...
#+end_src
* Is the build on cachix?
The way to check if a build is on cachix is to go to the Details tab on the build, copy the hash of the Output Store Path (/nix/store/lnzhlc1glhpiq96llrx715lfzhhqn5z2-emacs-pgtk-native-comp-20220919.0 has a hash of lnzhlc1glhpiq96llrx715lfzhhqn5z2) and run the following from your terminal:
#+begin_src sh
 curl https://nix-community.cachix.org/HASH.narinfo
#+end_src

If you get a 404 - Not Found error, the build isn't on cachix yet, while if you get a lot of information back, it's on there! As an example of a successful request, we have this

#+begin_src sh
 curl https://nix-community.cachix.org/lnzhlc1glhpiq96llrx715lfzhhqn5z2.narinfo
#+end_src

#+RESULTS:
| StorePath:   | /nix/store/lnzhlc1glhpiq96llrx715lfzhhqn5z2-emacs-pgtk-native-comp-20220919.0                                       |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
| URL:         | nar/3b812d5d33415d9aa94659765e7989fee5f343d682b99cd8d05fa741e4e1967a.nar.xz                                         |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
| Compression: | xz                                                                                                                  |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
| FileHash:    | sha256:3b812d5d33415d9aa94659765e7989fee5f343d682b99cd8d05fa741e4e1967a                                             |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
| FileSize:    | 79642328                                                                                                            |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
| NarHash:     | sha256:1axkkzs2x5n0cbawylgd6h7sdas7kvbyw4lf8k0pvqc8ppjjagn4                                                         |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
| NarSize:     | 314410272                                                                                                           |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
| References:  | 07qnbzi4vvk6pqv40bd92xxxrg3z6xix-libtiff-4.4.0                                                                      | 0xckwx6wrw62c8rwll52dp492al8h62j-cairo-1.16.0 | 2bg52i7h03ndrr9xj8zmi6wsq32xa3f3-gdk-pixbuf-2.42.8 | 32pc02l6l71ghln5kp48f71my5al7bcf-dconf-0.40.0-lib | 3lg565rimf27s0503rcydj5w8ncwdcxv-fontconfig-2.14.0-lib | 3v3bfg0h62nyblxp8cfp3gp162x031cy-libselinux-3.3 | 5aw4hi5yac800z5sh6i5flb4hxagbw0i-libpng-apng-1.6.37 | 8yhkcr2yq647wvd4wrbsaglccaf28j2d-sqlite-3.39.2 | 9yj3jdmm5g0jfbcmhxg0bqd75yjhlx9g-ncurses-6.3-p20220507 | a60blj59rlczhf411gr1lb9ghiy56mgy-libxml2-2.9.14 | bxays0cw5nr88fmyr90y0kkwkji9vk1q-binutils-wrapper-2.38 | bzd91shky9j9d43girrrj6vmqlw7x9m8-glibc-2.35-163 | fymd9xvf9p241xzs90qw5ycgmwcvjs1j-librsvg-2.54.4 | g62pmq7g0h5pqarg7yh7py40ychd6f28-glib-2.72.3 | hhwkvh589y34p6znr2rcv28zw9afjccj-systemd-251.4 | i96w3nijv65d78zx4bqma48ww51fx8is-gmp-with-cxx-6.2.1 | jfkmqz20q8fsaqizcml86adxqyzlwllx-binutils-2.38 | jmc2yflz77137badm2glh9avp9y0y7zz-gtk+3-3.24.34 | jyiybh44fcvypizjnl3yrffqr8mndhid-zlib-1.2.12 | l4dvshb0bw0ipyx17f6rknzk83mdx81y-gcc-11.3.0 | lnzhlc1glhpiq96llrx715lfzhhqn5z2-emacs-pgtk-native-comp-20220919.0 | mv50qh98il886vlc4iaipgsl1avjrzhh-pango-1.50.8 | nqhhav800n5l1hi288inif77hs91k4yk-dbus-1.14.0-lib | nrkh7wn11g9giaxa6labs6kf9490wm59-libotf-0.9.16 | p7bpdnxqd3i5hwm92mrscf7mvxk66404-bash-5.1-p16 | v1k4gv192kqxrzybjjh17qlqd9rz51gg-harfbuzz-5.1.0 | vg6wddsqw0sajw2rxhhmb72zqhzmn3rk-giflib-5.2.1 | x9l2dhc2hhdj96sczxxz7nnksfk08wlf-jansson-2.14 | xh696lkivvygg8bkpvj95vv3qspp2awx-gettext-0.21 | xxr1qbnkbnxfzlbn2q3bnnami7qpylgd-gsettings-desktop-schemas-42.0 | ycfba4cmlb5533qgfvsb5g771fwjyvix-gnutls-3.7.7 | yj93hl3rhxnhmvp9c3mfk4fhr1pgimrm-atk-2.38.0 | ykgwb51j5235xdbkqnznm2haygknmwc6-libgccjit-11.3.0 | yqwa1nhqyl3p9x0ldbps4n88jg7807y7-freetype-2.12.1 | z1pym90rlc2yc297wccqrzkqlxb9gdf1-libjpeg-turbo-2.1.4 |
| Deriver:     | dz89cfzvrvvbb7nmp7xd4npzakh8awnm-emacs-pgtk-native-comp-20220919.0.drv                                              |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
| Sig:         | nix-community.cachix.org-1:imgY6x4aDMYp4+nYELnlIE9HfkTxO4nMknvZ0xsmpTF08DojO7ImTd+C6Do0eKbZ9k5fOQPP3jpZf3C48WiACA== |                                               |                                                    |                                                   |                                                        |                                                 |                                                     |                                                |                                                        |                                                 |                                                        |                                                 |                                                 |                                              |                                                |                                                     |                                                |                                                |                                              |                                             |                                                                    |                                               |                                                  |                                                |                                               |                                                 |                                               |                                               |                                               |                                                                 |                                               |                                             |                                                   |                                                  |                                                      |
